app/Controllers/Admin_dashboard.php

SELECT *
FROM `videos`
SELECT COUNT(*) AS `numrows`
FROM `admin`
SELECT SUM(`duration`) AS `duration`
FROM `videos`
 LIMIT 1
---
    public function index(): string
    {
        $admin_id = session()->get('user_id'); // Use 'user_id' to match upload_video

        $data = [
            'title' => 'Admin Dashboard',
            'total_views' => $this->videoModel->where('uploaded_by', $admin_id)->selectSum('views')->first()['views'] ?? 0,
            'total_duration' => $this->videoModel->where('uploaded_by', $admin_id)->selectSum('duration')->first()['duration'] ?? 0,
            'total_subscribers' => $this->adminModel->countAllResults(),
            'videos' => $this->videoModel->where('uploaded_by', $admin_id)->findAll()
        ];

INSERT INTO `videos` (`title`, `description`, `video_path`, `uploaded_by`, `status`, `is_premium`, `duration`, `views`, `created_date`, `updated_date`) VALUES ('ENGLISH', '', 'uploads/videos/1752066914_25c6ab3c9a770f0f36dc.mp4', '3', 'active', 0, 0, 0, '2025-07-09 13:15:14', '2025-07-09 13:15:14')
---
                return redirect()->back()->with('error', 'User session invalid. Please log in again.');
            }

            if ($this->videoModel->insert($data)) {

SELECT SUM(`duration`) AS `duration`
FROM `videos`
 LIMIT 1
SELECT *
FROM `videos`
SELECT COUNT(*) AS `numrows`
FROM `admin`
SELECT SUM(`views`) AS `views`
FROM `videos`
WHERE `uploaded_by` IS NULL
 LIMIT 1
SELECT SUM(`duration`) AS `duration`
FROM `videos`
WHERE `uploaded_by` IS NULL
 LIMIT 1
SELECT *
FROM `videos`
WHERE `uploaded_by` IS NULL
---
    public function manage_videos(): string
    {
        $admin_id = session()->get('user_id'); // Use 'user_id' to match upload_video

        $data = [
            'title' => 'Manage Videos',
            'total_views' => $this->videoModel->where('uploaded_by', $admin_id)->selectSum('views')->first()['views'] ?? 0,
            'total_duration' => $this->videoModel->where('uploaded_by', $admin_id)->selectSum('duration')->first()['duration'] ?? 0,
            'total_subscribers' => $this->adminModel->countAllResults(),
            'videos' => $this->videoModel->where('uploaded_by', $admin_id)->findAll()
        ];