app/Controllers/Admin.php

    public function auth()
    {
        $session = session();
        $model = new AdminModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $admin = $model->where('email', $email)->first();
---
SELECT *
FROM `admin`
WHERE `email` = 'shivam@gmail.com'
 LIMIT 1